unitTests/channels1x2x2/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2306                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

10
(
    bottomWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          12;
        startFace       220;
    }
    topWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          12;
        startFace       232;
    }
    sides1_half0
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          12;
        startFace       244;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  sides1_half1;
    }
    sides1_half1
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          12;
        startFace       256;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  sides1_half0;
    }
    sides2_half0
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          12;
        startFace       268;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  sides2_half1;
    }
    sides2_half1
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          12;
        startFace       280;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  sides2_half0;
    }
    inout1_half0
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          16;
        startFace       292;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  inout1_half1;
    }
    inout1_half1
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          16;
        startFace       308;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  inout1_half0;
    }
    inout2_half0
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          16;
        startFace       324;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  inout2_half1;
    }
    inout2_half1
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          16;
        startFace       340;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  inout2_half0;
    }
)

// ************************************************************************* //
